<a href="https://colab.research.google.com/github/rubyspch/Colaboratory-Notes/blob/main/Pandas_merge_concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
 india_weather = pd.DataFrame({
     "city": ["mumbai", "delhi", "bangalore"],#
     "tempurature": [32, 45, 30],
     "humidity": [80, 60, 78]
 })
 india_weather

        city  tempurature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [4]:
 us_weather = pd.DataFrame({
     "city": ["new york", "chicago", "orlando"],#
     "tempurature": [21, 14, 35],
     "humidity": [60, 65, 75]
 })
 us_weather

       city  tempurature  humidity
0  new york           21        60
1   chicago           14        65
2   orlando           35        75

Created dfs, now want to concat them

In [7]:
df= pd.concat([india_weather, us_weather])
df

        city  tempurature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        60
1    chicago           14        65
2    orlando           35        75

new df created, but original indexes still applied. To reset index, add parameter ignore_index=True, by default it is false.

In [9]:
df2= pd.concat([india_weather, us_weather], ignore_index=True)
df2

        city  tempurature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        60
4    chicago           14        65
5    orlando           35        75

can also pass keys.
if you want to retrieve indian city temps still, pass argument keys= to associate a key to each of the dataframes you are concatonating:

In [10]:
df3= pd.concat([india_weather, us_weather], keys=["india", "us"])
df3

              city  tempurature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        60
      1    chicago           14        65
      2    orlando           35        75

then to select one of the original dataframes again use loc to grab the key:

In [11]:
df3.loc["us"]

       city  tempurature  humidity
0  new york           21        60
1   chicago           14        65
2   orlando           35        75

can also append dataframes as columns...Below you want to combine dataframes to get one with both windspeed and temp. do this by adding axis parameter. 

axis parameter by default is 0 (rows), change to 1 for columns...

In [13]:
tempurature= pd.DataFrame({
     "city": ["new york", "chicago", "orlando"],#
     "tempurature": [21, 14, 35]
})
tempurature

       city  tempurature
0  new york           21
1   chicago           14
2   orlando           35

In [14]:
windspeed= pd.DataFrame({
     "city": ["new york", "chicago", "orlando"],#
     "windspeed": [3, 4, 7],
})
windspeed

       city  windspeed
0  new york          3
1   chicago          4
2   orlando          7

In [15]:
df4=pd.concat([tempurature, windspeed], axis=1)
df4

       city  tempurature      city  windspeed
0  new york           21  new york          3
1   chicago           14   chicago          4
2   orlando           35   orlando          7

if a value is missing, eg no temp data for one of the cities, it would just appear as NaN. 

if the cities were in the wrong order, you can use the index argument (a better way to do this is with merge):

In [18]:
windspeed2= pd.DataFrame({
     "city": ["new york", "chicago", "orlando"],
     "windspeed": [3, 4, 7],
}, index=[0, 1, 2]) #index for the 3 rows, doing this gives you control over the index while concatonating dfs
tempurature2= pd.DataFrame({
     "city": ["chicago", "new york"],
     "tempurature": [21, 14]
}, index=[1,0]) #index for the 2 rows, corresponding with the windspeed2 index rows
df5=pd.concat([tempurature2, windspeed2], axis=1)
df5

       city  tempurature      city  windspeed
0  new york         14.0  new york          3
1   chicago         21.0   chicago          4
2       NaN          NaN   orlando          7

How to concat a series to a df:

In [20]:
s= pd.Series(["Humid", "Dry", "Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [21]:
df6= pd.concat([tempurature, s], axis=1)
df6

       city  tempurature  event
0  new york           21  Humid
1   chicago           14    Dry
2   orlando           35   Rain

^ Doing this adds a series onto the df as a column.

Using merge() to concat:
on="" attrib tells merge which column to merge on

In [22]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35]
})
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75]
})
df3= pd.merge(df1,df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

what if different cities present in the merged dfs...

In [24]:
df4=pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity": [65,68,75],
})
df5= pd.DataFrame({
    "city": ["chicago","new york", "orlando", "baltimore"],
    "temperature": [21,14,35, 20]
})
df6=pd.merge(df4,df5, on="city")
df6

       city  humidity  temperature
0   chicago        65           21
1  new york        68           14

... then it performs an inner join. meaning is joins the dfs based on the common cities bc thats the index youve chosen. 
meaning, in a venn diagram it merges just the common cities and discards the rest.

to get the rest use the attribute how="outer":

inner is the default.

In [26]:
df7=pd.merge(df4,df5, on="city", how="outer")
df7

            city  humidity  temperature
0        chicago      65.0         21.0
1       new york      68.0         14.0
2  san francisco      75.0          NaN
3        orlando       NaN         35.0
4      baltimore       NaN         20.0

can also do how = left or right...

this would include the 'left' hand side extra elements, meaning the first one you list. And right the right side elements are included.

In [27]:
df8=pd.merge(df4,df5, on="city", how="left")
df8

            city  humidity  temperature
0        chicago        65         21.0
1       new york        68         14.0
2  san francisco        75          NaN

indictor=true gives details of the merge:

In [28]:
df9=pd.merge(df4,df5, on="city", how="outer", indicator=True)
df9

            city  humidity  temperature      _merge
0        chicago      65.0         21.0        both
1       new york      68.0         14.0        both
2  san francisco      75.0          NaN   left_only
3        orlando       NaN         35.0  right_only
4      baltimore       NaN         20.0  right_only

If you have the same columns in both dfs when merging you get x version and y version:

In [30]:
df10=pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity": [65,68,75],
    "tempurature":[12, 20, 19]
})
df11=pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity": [50,48,30],
    "tempurature":[15, 24, 17]
})
df12= pd.merge(df10, df11, on="city")
df12

            city  humidity_x  tempurature_x  humidity_y  tempurature_y
0        chicago          65             12          50             15
1       new york          68             20          48             24
2  san francisco          75             19          30             17

make the suffixes clearer by using attrib suffixes="" to add more descriptive stuff:

In [32]:
df13= pd.merge(df10, df11, on="city", suffixes=("_left", "_right"))
df13

            city  humidity_left  ...  humidity_right  tempurature_right
0        chicago             65  ...              50                 15
1       new york             68  ...              48                 24
2  san francisco             75  ...              30                 17

[3 rows x 5 columns]